In [22]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [23]:
import json
with open('gender_m.json') as json_data:
    data = json.load(json_data)

df = pd.DataFrame({'terms':data})
df

            terms
0           abbot
1     able_seaman
2          adonis
3    aircraftsman
4      aircrewman
..            ...
590       yardman
591       yardman
592    yellow_man
593        yeoman
594        yeoman

[595 rows x 1 columns]

In [24]:
df = df.drop_duplicates(subset=['terms'])
df['terms'] = df['terms'].astype(str).str.replace('_', ' ')
df

C:\Users\Low Xue Ling\AppData\Local\Temp\ipykernel_62960\2397720770.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['terms'] = df['terms'].astype(str).str.replace('_', ' ')

            terms
0           abbot
1     able seaman
2          adonis
3    aircraftsman
4      aircrewman
..            ...
588       workman
589     yachtsman
590       yardman
592    yellow man
593        yeoman

[523 rows x 1 columns]

In [25]:
df.to_csv('gender_m_cleaned.csv', index=False, header=None)